---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction
source: html/d2d6b79f-78ec-af94-8d29-ecc20255275e.htm
---
# MEPSpaceConstruction Properties

Get all the Building Constructions according to the specific Construction type.